posts/2021-08-22-home-manager/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 21 Dec. 2022 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Home Manager</title>
<meta name="author" content="Arjen Wiersma" />
<meta name="generator" content="Org Mode" />
<meta description='Writings by Arjen'/>
<link rel='alternate' type='application+rss/xml' title='Writings by Arjen' href='/posts/rss.xml'/>
<link rel="stylesheet" href="../../css/theme.css?v=20216e086cf8a20ead56908f3be0bcda6af2531ec1a68c9058ee7495590f57ea" type="text/css">
</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">Home Manager</h1>
<p class="subtitle" role="doc-subtitle">Reproducible environments with home-manager</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org24728f0">Abstract</a></li>
<li><a href="#orgc63d4b6">The tools</a>
<ul>
<li><a href="#org88d88d7">POP_os and NixOS</a></li>
<li><a href="#orgc1ff9f4">Home Manager</a></li>
<li><a href="#org0275f45">Setup</a></li>
</ul>
</li>
<li><a href="#orgf49c3a1">Configuration</a>
<ul>
<li><a href="#org8dfdcf2">Basic structure</a></li>
<li><a href="#org5172906">Applying changes</a></li>
<li><a href="#org86a9bb8">Bleeding edge Emacs</a></li>
<li><a href="#org8d9eb09">A full texlive</a></li>
<li><a href="#org46aa281">Commercial tools</a></li>
<li><a href="#org2e1014d">A Haskell environment</a></li>
</ul>
</li>
<li><a href="#orgebe06ba">Full home.nix</a></li>
</ul>
</div>
</nav>
<p>
This is still a draft
</p>

<section id="outline-container-org24728f0" class="outline-2">
<h2 id="org24728f0">Abstract</h2>
</section>

<section id="outline-container-orgc63d4b6" class="outline-2">
<h2 id="orgc63d4b6">The tools</h2>
<div class="outline-text-2" id="text-orgc63d4b6">
</div>
<div id="outline-container-org88d88d7" class="outline-3">
<h3 id="org88d88d7">POP_os and NixOS</h3>
</div>

<div id="outline-container-orgc1ff9f4" class="outline-3">
<h3 id="orgc1ff9f4">Home Manager</h3>
</div>

<div id="outline-container-org0275f45" class="outline-3">
<h3 id="org0275f45">Setup</h3>
</div>
</section>

<section id="outline-container-orgf49c3a1" class="outline-2">
<h2 id="orgf49c3a1">Configuration</h2>
<div class="outline-text-2" id="text-orgf49c3a1">
</div>
<div id="outline-container-org8dfdcf2" class="outline-3">
<h3 id="org8dfdcf2">Basic structure</h3>
<div class="outline-text-3" id="text-org8dfdcf2">
<div class="org-src-container">
<pre class="src src-nix">{ config, pkgs, ... }:

{
  # Let Home Manager install and manage itself.
  programs.home-manager.enable = true;

  # Home Manager needs a bit of information about you and the
  # paths it should manage.
  home.username = "arjen";
  home.homeDirectory = "/home/arjen";

  # Packages
  home.packages = [
    # list packages to install
  ];

  # This value determines the Home Manager release that your
  # configuration is compatible with. This helps avoid breakage
  # when a new Home Manager release introduces backwards
  # incompatible changes.
  #
  # You can update Home Manager without changing this value. See
  # the Home Manager release notes for a list of state version
  # changes in each release.
  home.stateVersion = "21.11";
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5172906" class="outline-3">
<h3 id="org5172906">Applying changes</h3>
<div class="outline-text-3" id="text-org5172906">
<p>
Yes, every time you update <code>loader.org</code> you need to do a <code>switch</code>.
</p>

<p>
Do not forget to remove the old <code>loader.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">bash</span>

nix-channel --update

<span class="org-keyword">if</span> [ -f ~/.emacs.d/loader.el ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Cleaning old generated files (loader)"</span>
    rm ~/.emacs.d/loader.el
<span class="org-keyword">fi</span>

home-manager switch
</pre>
</div>
</div>
</div>

<div id="outline-container-org86a9bb8" class="outline-3">
<h3 id="org86a9bb8">Bleeding edge Emacs</h3>
<div class="outline-text-3" id="text-org86a9bb8">
<p>
Add the <code>emacs-overlay</code> to the configuration.
</p>

<div class="org-src-container">
<pre class="src src-nix">{
  nixpkgs.overlays = [
    (import (builtins.fetchTarball {
      url = https://github.com/nix-community/emacs-overlay/archive/master.tar.gz;
    }))
  ];
}
</pre>
</div>

<p>
Highly recommended to add binary caches.
</p>

<div class="org-src-container">
<pre class="src src-shell">nix-env -iA cachix -f https://cachix.org/api/v1/install
cachix use nix-community
</pre>
</div>

<p>
Install the Emacs version you want, I chose the Pure GTK and Native Compilation combination.
</p>

<p>
Emacs itself is <a href="https://emacshorrors.com/posts/psa-emacs-is-not-a-proper-gtk-application.html">not a proper GTK application</a>, what that means is that it does not do fractional scaling, does not work on Wayland and does not integrate fully with the system clipboard. The Pure GTK branch brings these features into play for Emacs.
</p>

<p>
<a href="http://akrl.sdf.org/gccemacs.html">Native Compilation</a> fixes another issue in Emacs; speed. Using the native-comp branch will speed up the emacs-lisp packages from 2.5x to 42x! Personally I notice this the most when editing large org-mode files.
</p>

<p>
If you want to get this working without doing the steps in this document I highly recommend a post by <a href="http://www.cesarolea.com/posts/emacs-native-compile/">Cesar Olea</a> on how to get both Pure GTK and Native Compilation on a Ubuntu based system.
</p>

<p>
Different flavors:
</p>

<ul class="org-ul">
<li>emacsGit</li>
<li>emacsGcc</li>
<li>emacsPgtk</li>
<li>emacsPgtkGcc</li>
<li>emacsUnstable</li>
</ul>

<p>
I choose to use emacsPgtkGcc
</p>

<div class="org-src-container">
<pre class="src src-nix">{
  programs.emacs = {
    enable = true;
    package = pkgs.emacsPgtkGcc;
  };
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d9eb09" class="outline-3">
<h3 id="org8d9eb09">A full texlive</h3>
</div>
<div id="outline-container-org46aa281" class="outline-3">
<h3 id="org46aa281">Commercial tools</h3>
</div>
<div id="outline-container-org2e1014d" class="outline-3">
<h3 id="org2e1014d">A Haskell environment</h3>
</div>
</section>

<section id="outline-container-orgebe06ba" class="outline-2">
<h2 id="orgebe06ba">Full home.nix</h2>
<div class="outline-text-2" id="text-orgebe06ba">
<div class="org-src-container">
<pre class="src src-nix">{ config, pkgs, ... }:

let
  latex = pkgs.texlive.combine {
    inherit (pkgs.texlive) scheme-full
      wrapfig capt-of preview lxfonts # for ox-beamer
      fontawesome5 awesomebox
      ;
  };
in
{
  nixpkgs.config.packageOverrides = pkgs: {
    nur = import (builtins.fetchTarball "https://github.com/nix-community/NUR/archive/master.tar.gz") {
      inherit pkgs;
    };
  };

  # https://gist.github.com/mjlbach/179cf58e1b6f5afcb9a99d4aaf54f549
  nixpkgs.overlays = [
    (import (builtins.fetchTarball {
      url = https://github.com/nix-community/emacs-overlay/archive/master.tar.gz;
    }))
  ];

  # Let Home Manager install and manage itself.
  programs.home-manager.enable = true;

  # Allow installation of jetbrains programs
  nixpkgs.config.allowUnfree = true;

  # Home Manager needs a bit of information about you and the
  # paths it should manage.
  home.username = "arjen";
  home.homeDirectory = "/home/arjen";

  fonts.fontconfig.enable = true;

  # Packagers
  home.packages = [
    pkgs.tmux
    pkgs.exa
    pkgs.bat
    pkgs.mu
    pkgs.hunspell
    pkgs.hunspellDicts.en_US
    pkgs.hunspellDicts.nl_NL
    pkgs.ghc
    pkgs.cabal-install
    pkgs.cabal2nix
    pkgs.stack
    pkgs.hlint
    pkgs.ormolu
    pkgs.haskell-language-server
    pkgs.jdk
    pkgs.jetbrains.phpstorm
    pkgs.jetbrains.idea-ultimate
    pkgs.emacs-all-the-icons-fonts
    pkgs.nerdfonts
    pkgs.fira-code
    pkgs.fira-code-symbols
    latex
    pkgs.pandoc
  ];

  programs.emacs = {
    enable = true;
    package = pkgs.emacsPgtkGcc;
  };

  home.file.".emacs.d/loader.org".source = ./loader.org;
  home.file.".emacs.d/init.el".source = ./init.el;

  programs.git = {
    enable = true;
    userName = "Your name";
    userEmail = "Your email";
    aliases = {
      st = "status";
    };
  };

  # This value determines the Home Manager release that your
  # configuration is compatible with. This helps avoid breakage
  # when a new Home Manager release introduces backwards
  # incompatible changes.
  #
  # You can update Home Manager without changing this value. See
  # the Home Manager release notes for a list of state version
  # changes in each release.
  home.stateVersion = "21.11";
}
</pre>
</div>
</div>
</section>
</main>
</body>
</html>